
## :x: Apply Failed

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8227904183)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_vendor.vendor: Reading...
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
pagerduty_team.pd_team["poc"]: Refreshing state... [id=PVFT88T]
data.pagerduty_vendor.vendor: Read complete after 1s [id=PAM4FGS]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Refreshing state... [id=POCJ4A2:PVFT88T]
pagerduty_escalation_policy.pd_esp["poc-system"]: Refreshing state... [id=PD6MH3X]
pagerduty_service.pd_service["poc-system"]: Refreshing state... [id=PZQGPHK]
pagerduty_service_integration.datadog["poc-system"]: Refreshing state... [id=PR24E6U]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.pagerduty_users.pd_users["poc-pd-svc"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # data.pagerduty_users.pd_users["poc-pk8s-svc"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # pagerduty_escalation_policy.pd_esp["poc-pd-svc"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-pd-svc"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-pk8s-svc"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-system"] will be destroyed
  # (because key ["poc-system"] is not in for_each map)
  - resource "pagerduty_escalation_policy" "pd_esp" {
      - description = "Managed by Terraform" -> null
      - id          = "PD6MH3X" -> null
      - name        = "escalation-policy-poc-system" -> null
      - num_loops   = 3 -> null
      - teams       = [
          - "PVFT88T",
        ] -> null

      - rule {
          - escalation_delay_in_minutes = 10 -> null
          - id                          = "P3J5PGJ" -> null

          - escalation_rule_assignment_strategy {
              - type = "assign_to_everyone" -> null
            }

          - target {
              - id   = "P2CJ343" -> null
              - type = "schedule_reference" -> null
            }
        }
    }

  # pagerduty_service.pd_service["poc-pd-svc"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-Pd-Svc"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-pk8s-svc"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-Pk8s-Svc"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-system"] will be destroyed
  # (because key ["poc-system"] is not in for_each map)
  - resource "pagerduty_service" "pd_service" {
      - acknowledgement_timeout = "1200" -> null
      - alert_creation          = "create_alerts_and_incidents" -> null
      - alert_grouping          = "intelligent" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "86400" -> null
      - created_at              = "2024-03-10T16:35:17+09:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PD6MH3X" -> null
      - html_url                = "https://fastretailing-staging.pagerduty.com/service-directory/PZQGPHK" -> null
      - id                      = "PZQGPHK" -> null
      - last_incident_timestamp = "2024-03-11T13:50:22+09:00" -> null
      - name                    = "Poc-System" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
          - type = "intelligent" -> null

          - config {
              - fields      = [] -> null
              - time_window = 300 -> null
              - timeout     = 0 -> null
            }
        }

      - auto_pause_notifications_parameters {
          - enabled = true -> null
          - timeout = 300 -> null
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service_integration.datadog["poc-pd-svc"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-pd-svc"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-pk8s-svc"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-pk8s-svc"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-system"] will be destroyed
  # (because key ["poc-system"] is not in for_each map)
  - resource "pagerduty_service_integration" "datadog" {
      - html_url        = "https://fastretailing-staging.pagerduty.com/services/PZQGPHK/integrations/PR24E6U" -> null
      - id              = "PR24E6U" -> null
      - integration_key = "570ce116739a460dd06255259c468609" -> null
      - name            = "datadog-integration-poc-system" -> null
      - service         = "PZQGPHK" -> null
      - type            = "generic_events_api_inbound_integration" -> null
      - vendor          = "PAM4FGS" -> null
    }

  # pagerduty_team.pd_team["poc"] will be destroyed
  # (because key ["poc"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/PVFT88T" -> null
      - id           = "PVFT88T" -> null
      - name         = "poc" -> null
    }

  # pagerduty_team.pd_team["poc-k8s"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "poc-k8s"
    }

  # pagerduty_team.pd_team["poc-pd"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "poc-pd"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"] will be destroyed
  # (because key ["poc"] is not in for_each map)
  - resource "pagerduty_team_membership" "team_membership" {
      - id      = "POCJ4A2:PVFT88T" -> null
      - role    = "manager" -> null
      - team_id = "PVFT88T" -> null
      - user_id = "POCJ4A2" -> null
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

Plan: 10 to add, 0 to change, 5 to destroy.
pagerduty_service_integration.datadog["poc-system"]: Destroying... [id=PR24E6U]
pagerduty_service_integration.datadog["poc-system"]: Destruction complete after 0s
pagerduty_service.pd_service["poc-system"]: Destroying... [id=PZQGPHK]
pagerduty_service.pd_service["poc-system"]: Destruction complete after 1s
pagerduty_escalation_policy.pd_esp["poc-system"]: Destroying... [id=PD6MH3X]
pagerduty_escalation_policy.pd_esp["poc-system"]: Destruction complete after 1s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Destroying... [id=POCJ4A2:PVFT88T]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Destruction complete after 0s
pagerduty_team.pd_team["poc"]: Destroying... [id=PVFT88T]
pagerduty_team.pd_team["poc-pd"]: Creating...
pagerduty_team.pd_team["poc-k8s"]: Creating...
pagerduty_team.pd_team["poc-k8s"]: Creation complete after 2s [id=P31QTVE]
pagerduty_team.pd_team["poc-pd"]: Creation complete after 2s [id=P6ABU84]
╷
│ Error: DELETE API call to https://api.pagerduty.com/teams/PVFT88T failed 400 Bad Request. Code: 6006, Errors: [Cannot delete team with existing Schedules association(s)], Message: Team has existing associations
│ 
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":8,"Program":"tfcmt","SHA1":"83501b93cf5ae183386b49a4cae912e1d2bce019","Vars":{},"WorkflowName":"Plan"} -->